spec/support/vcr_cassettes/preneeds/attachment_types/gets_a_list_of_attachment_types.yml

---
http_interactions:
- request:
    method: post
    uri: "<PRENEEDS_HOST>/eoas_SOA/PreNeedApplicationPort"
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://service.soa.eoas.cem.va.gov/"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:getAttachmentTypes></tns:getAttachmentTypes></env:Body></env:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 16 Jun 2017 04:56:00 GMT
      Transfer-Encoding:
      - chunked
      Content-Type:
      - multipart/related;start="<rootpart*c97280ca-cea9-475b-a505-720598c95d7b@example.jaxws.sun.com>";type="application/xop+xml";boundary="uuid:c97280ca-cea9-475b-a505-720598c95d7b";start-info="text/xml"
    body:
      encoding: UTF-8
      string: "--uuid:c97280ca-cea9-475b-a505-720598c95d7b\r\nContent-Id: <rootpart*c97280ca-cea9-475b-a505-720598c95d7b@example.jaxws.sun.com>\r\nContent-Type:
        application/xop+xml;charset=utf-8;type=\"text/xml\"\r\nContent-Transfer-Encoding:
        binary\r\n\r\n<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><ns2:getAttachmentTypesResponse
        xmlns:ns2=\"http://service.soa.eoas.cem.va.gov/\"><return><attachmentTypeId>1</attachmentTypeId><description>DISCHARGE</description></return><return><attachmentTypeId>2</attachmentTypeId><description>MARRIAGE
        RELATED</description></return><return><attachmentTypeId>3</attachmentTypeId><description>DEPENDENT
        RELATED</description></return><return><attachmentTypeId>4</attachmentTypeId><description>VA
        PRENEED FORM</description></return><return><attachmentTypeId>5</attachmentTypeId><description>LETTER</description></return><return><attachmentTypeId>6</attachmentTypeId><description>OTHER</description></return></ns2:getAttachmentTypesResponse></S:Body></S:Envelope>\r\n--uuid:c97280ca-cea9-475b-a505-720598c95d7b--"
    http_version:
  recorded_at: Fri, 16 Jun 2017 04:55:45 GMT
recorded_with: VCR 3.0.3
